modules/api/modules/v1/models/Products.php

SELECT COUNT(*) FROM `products` WHERE `active_status`=1
---
    public function fetchallproduct()
    {
        $products = Products::find()->where(['active_status' => 1]);

        $count = $products->count();